Revit 2027 API
FabricationOptionDefinition.IsModifiable Property
 Checks if the fabrication option is modifiable by user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsModifiable { get; }
Public ReadOnly Property IsModifiable As Boolean
	Get
public:
property bool IsModifiable {
	bool get ();
}
member IsModifiable : bool with get
Property Value
Boolean
See Also
Reference
FabricationOptionDefinition Class
Autodesk.Revit.DB Namespace